# SQLite Tutorial

Documentation at: https://docs.python.org/3/library/sqlite3.html

# Quire of SQLite

* Data Types .
* No Right or Full Outer Joins.
* Alter Table is very useful add, Remove , column and table name.
* Tables default to having a unique integer rowid column.
* SQLite is a library not a service.
* In-Memory Database Feature.

load the sqlite package

In [1]:
import sqlite3

print(sqlite3.sqlite_version)

3.40.1

Connect to the database.

In [2]:
conn = sqlite3.connect('school.db')

In [3]:
cur = conn.cursor()
cur.execute('select * from student')

In [4]:
cur.fetchone()

(1,
 'alyar',
 '2',
 'RED',
 'Male',
 'A',
 'ali',
 'pabbi',
 333,
 2000,
 345,
 1000.0,
 400.0,
 300.0,
 300.0,
 300.0,
 'Paid')

In [5]:
print(cur.fetchone())

(3, 'arfa jani', '1', 'YELLOW', 'Female', 'D', 'maryam', 'PABBI', 335, 1000, 345, 1200.0, 200.0, 1000.0, 1000.0, 400.0, 'Unpaid')

In [7]:
for row in cur.execute('SELECT * FROM student'):
    print(row)

(1, 'alyar', '2', 'RED', 'Male', 'A', 'ali', 'pabbi', 333, 2000, 345, 1000.0, 400.0, 300.0, 300.0, 300.0, 'Paid')
(3, 'arfa jani', '1', 'YELLOW', 'Female', 'D', 'maryam', 'PABBI', 335, 1000, 345, 1200.0, 200.0, 1000.0, 1000.0, 400.0, 'Unpaid')
(4, 'azam', '3', 'RED', 'Male', 'A', 'ali', 'pabbi', 345, 3000, 3331234567, 300.0, 0.0, 0.0, 0.0, 0.0, 'Paid')
(5, 'bacha', '5', 'RED', 'Male', 'A', 'tariq', 'pabbi', 123456789, 5000, 3331234567, 1000.0, 1000.0, 3000.0, 3000.0, 1000.0, 'Paid')
(6, 'ali khan', '1', 'RED', 'Male', 'A', 'tariq', 'pabbi', 1234567890, 1000, 3331234567, 1000.0, 500.0, 1000.0, 1000.0, 200.0, 'Paid')
(7, 'hamza', '4', 'RED', 'Male', 'A', 'tatiq', 'pabbi', 12121212, 2000, 3331234567, 1000.0, 2000.0, 2000.0, 1000.0, 1000.0, 'Paid')
(8, 'maryam', '3', 'BLUE', 'Female', 'B', 'tariq', 'pabbi', 3331234567, 1000, 3331234567, 0.0, 0.0, 0.0, 0.0, 0.0, 'Unpaid')
(9, 'alyar Tariq', '1', 'BLUE', 'Male', 'B', 'tariq', 'usman abad', 3339139164, 1000, 3331234567, 500.0, 300.0, 200.0, 1000.0, 200.0, 'Unpaid')
(10, 'nimra', '3', 'GREEN', 'Female', 'C', 'maryam', 'pabbi', 331, 2000, 3331234567, 200.0, 0.0, 200.0, 1000.0, 200.0, 'Unpaid')

In [8]:
for row in cur.execute('SELECT * FROM student limit 3'):
    print(row)

(1, 'alyar', '2', 'RED', 'Male', 'A', 'ali', 'pabbi', 333, 2000, 345, 1000.0, 400.0, 300.0, 300.0, 300.0, 'Paid')
(3, 'arfa jani', '1', 'YELLOW', 'Female', 'D', 'maryam', 'PABBI', 335, 1000, 345, 1200.0, 200.0, 1000.0, 1000.0, 400.0, 'Unpaid')
(4, 'azam', '3', 'RED', 'Male', 'A', 'ali', 'pabbi', 345, 3000, 3331234567, 300.0, 0.0, 0.0, 0.0, 0.0, 'Paid')

In [9]:
import pandas as pd

In [10]:
pd.read_sql_query('SELECT * FROM student limit 3' , conn)

,id,name,class_,section,gender,grade,teacher_name,address,contact,fee,driver_contact,transport_fee,uniform_dues,books_dues,admission_fee,paper_money,fee_status
0,1,alyar,2,RED,Male,A,ali,pabbi,333,2000,345,1000.0,400.0,300.0,300.0,300.0,Paid
1,3,arfa jani,1,YELLOW,Female,D,maryam,PABBI,335,1000,345,1200.0,200.0,1000.0,1000.0,400.0,Unpaid
2,4,azam,3,RED,Male,A,ali,pabbi,345,3000,3331234567,300.0,0.0,0.0,0.0,0.0,Paid

In [14]:
pd.read_sql_query("SELECT * FROM student where name ='alyar' " , conn)

,id,name,class_,section,gender,grade,teacher_name,address,contact,fee,driver_contact,transport_fee,uniform_dues,books_dues,admission_fee,paper_money,fee_status
0,1,alyar,2,RED,Male,A,ali,pabbi,333,2000,345,1000.0,400.0,300.0,300.0,300.0,Paid

In [16]:
pd.read_sql_query("SELECT name , section , gender , teacher_name , address FROM student where name ='alyar' " , conn)

    name section gender teacher_name address
0  alyar     RED   Male          ali   pabbi

##        pandasql library

In [147]:
import seaborn as sns

In [75]:
from pandasql import sqldf

def pysqldf(q):
    """this function eliminates the need to include locals/globals all the time"""
    return sqldf('school', globals())

In [173]:
penguins = sns.load_dataset('penguins')
penguins.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female

sqldf function from the pandasql library to  <br>
execute a SQL query on a pandas DataFrame called "penguins".

In [151]:
sqldf('''SELECT species, island 
FROM penguins 
LIMIT 5''')

  species     island
0  Adelie  Torgersen
1  Adelie  Torgersen
2  Adelie  Torgersen
3  Adelie  Torgersen
4  Adelie  Torgersen

The type() function is then used to determine the data type of the output of the sqldf function. <br>
• The output is a pandas DataFrame, so the type() function will return .

In [150]:
type(sqldf('''SELECT species, island 
                      FROM penguins 
                     LIMIT 5'''))

pandas.core.frame.DataFrame

Display unique rows in pandas and sqlite

In [153]:
penguins['species'].unique()

array(['Adelie', 'Chinstrap', 'Gentoo'], dtype=object)

In [156]:
sqldf('''SELECT Distinct species, island 
                      FROM penguins 
                     ''')

     species     island
0     Adelie  Torgersen
1     Adelie     Biscoe
2     Adelie      Dream
3  Chinstrap      Dream
4     Gentoo     Biscoe

sorting the data

In [158]:
sqldf('''SELECT body_mass_g 
                 FROM penguins 
                ORDER BY body_mass_g DESC 
                LIMIT 5''')

   body_mass_g
0       6300.0
1       6050.0
2       6000.0
3       6000.0
4       5950.0

In [160]:
penguins['body_mass_g'].sort_values(ascending=False, 
ignore_index=True).head()

0    6300.0
1    6050.0
2    6000.0
3    6000.0
4    5950.0
Name: body_mass_g, dtype: float64

filtering data

In [161]:
sqldf('''SELECT DISTINCT species
                 FROM penguins 
                WHERE sex = 'Male' 
                  AND flipper_length_mm > 210''')

     species
0  Chinstrap
1     Gentoo

In [174]:
penguins[(penguins['sex'] == 'Male') & (penguins['flipper_length_mm'] >210)]['species'].unique()

array(['Chinstrap', 'Gentoo'], dtype=object)

Grouping and aggregating data

In [175]:
sqldf('''SELECT species, MAX(bill_length_mm)
                 FROM penguins 
                GROUP BY species''')

     species  MAX(bill_length_mm)
0     Adelie                 46.0
1  Chinstrap                 58.0
2     Gentoo                 59.6

In [183]:
penguins[['species','bill_length_mm']].groupby('species',as_index=False).max()

     species  bill_length_mm
0     Adelie            46.0
1  Chinstrap            58.0
2     Gentoo            59.6

mathematical operations with pandasql

In [184]:
sqldf('''SELECT bill_length_mm / bill_depth_mm AS length_to_depth
                 FROM penguins
                ORDER BY length_to_depth DESC
                LIMIT 5''')

   length_to_depth
0         3.612676
1         3.510490
2         3.505882
3         3.492424
4         3.458599

In [193]:
penguins['ength_to_depth']=penguins['bill_length_mm'] / penguins['bill_depth_mm']
penguins['ength_to_depth'].sort_values(ascending=False , ignore_index=True).head()

0    3.612676
1    3.510490
2    3.505882
3    3.492424
4    3.458599
Name: ength_to_depth, dtype: float64

In [197]:
data = pd.read_csv('Data/DimDate.csv')
data1 =data[data['DateKey']  >= 20052231]
data1

,DateKey,FullDateAlternateKey,DayNumberOfWeek,EnglishDayNameOfWeek,SpanishDayNameOfWeek,FrenchDayNameOfWeek,DayNumberOfMonth,DayNumberOfYear,WeekNumberOfYear,EnglishMonthName,SpanishMonthName,FrenchMonthName,MonthNumberOfYear,CalendarQuarter,CalendarYear,CalendarSemester,FiscalQuarter,FiscalYear,FiscalSemester
365,20060101,2006-01-01,1,Sunday,Domingo,Dimanche,1,1,1,January,Enero,Janvier,1,1,2006,1,3,2006,2
366,20060102,2006-01-02,2,Monday,Lunes,Lundi,2,2,1,January,Enero,Janvier,1,1,2006,1,3,2006,2
367,20060103,2006-01-03,3,Tuesday,Martes,Mardi,3,3,1,January,Enero,Janvier,1,1,2006,1,3,2006,2
368,20060104,2006-01-04,4,Wednesday,Miércoles,Mercredi,4,4,1,January,Enero,Janvier,1,1,2006,1,3,2006,2
369,20060105,2006-01-05,5,Thursday,Jueves,Jeudi,5,5,1,January,Enero,Janvier,1,1,2006,1,3,2006,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3647,20141227,2014-12-27,7,Saturday,Sábado,Samedi,27,361,52,December,Diciembre,Décembre,12,4,2014,2,2,2014,1
3648,20141228,2014-12-28,1,Sunday,Domingo,Dimanche,28,362,53,December,Diciembre,Décembre,12,4,2014,2,2,2014,1
3649,20141229,2014-12-29,2,Monday,Lunes,Lundi,29,363,53,December,Diciembre,Décembre,12,4,2014,2,2,2014,1
3650,20141230,2014-12-30,3,Tuesday,Martes,Mardi,30,364,53,December,Diciembre,Décembre,12,4,2014,2,2,2014,1
3651,20141231,2014-12-31,4,Wednesday,Miércoles,Mercredi,31,365,53,December,Diciembre,Décembre,12,4,2014,2,2,2014,1

In [61]:
pysqldf('''select * from data  where  DateKey >= 20052231''')

,DateKey,FullDateAlternateKey,DayNumberOfWeek,EnglishDayNameOfWeek,SpanishDayNameOfWeek,FrenchDayNameOfWeek,DayNumberOfMonth,DayNumberOfYear,WeekNumberOfYear,EnglishMonthName,SpanishMonthName,FrenchMonthName,MonthNumberOfYear,CalendarQuarter,CalendarYear,CalendarSemester,FiscalQuarter,FiscalYear,FiscalSemester
0,20060101,2006-01-01,1,Sunday,Domingo,Dimanche,1,1,1,January,Enero,Janvier,1,1,2006,1,3,2006,2
1,20060102,2006-01-02,2,Monday,Lunes,Lundi,2,2,1,January,Enero,Janvier,1,1,2006,1,3,2006,2
2,20060103,2006-01-03,3,Tuesday,Martes,Mardi,3,3,1,January,Enero,Janvier,1,1,2006,1,3,2006,2
3,20060104,2006-01-04,4,Wednesday,Miércoles,Mercredi,4,4,1,January,Enero,Janvier,1,1,2006,1,3,2006,2
4,20060105,2006-01-05,5,Thursday,Jueves,Jeudi,5,5,1,January,Enero,Janvier,1,1,2006,1,3,2006,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3282,20141227,2014-12-27,7,Saturday,Sábado,Samedi,27,361,52,December,Diciembre,Décembre,12,4,2014,2,2,2014,1
3283,20141228,2014-12-28,1,Sunday,Domingo,Dimanche,28,362,53,December,Diciembre,Décembre,12,4,2014,2,2,2014,1
3284,20141229,2014-12-29,2,Monday,Lunes,Lundi,29,363,53,December,Diciembre,Décembre,12,4,2014,2,2,2014,1
3285,20141230,2014-12-30,3,Tuesday,Martes,Mardi,30,364,53,December,Diciembre,Décembre,12,4,2014,2,2,2014,1
3286,20141231,2014-12-31,4,Wednesday,Miércoles,Mercredi,31,365,53,December,Diciembre,Décembre,12,4,2014,2,2,2014,1

these are the table in sqlite databases

* databases name -> school
* table name -> dimate

In [80]:
dimdate = '''
DROP TABLE IF EXISTS dimdate;

CREATE TABLE dimdate (
    DateKey                INTEGER NOT NULL PRIMARY KEY,
    DateValue              DATE    NOT NULL,
    DayNumberOfWeek        INTEGER NOT NULL,
    DayNameOfWeek          TEXT    NOT NULL,
    DayNumberOfMonth       INTEGER NOT NULL,
    DayNumberOfYear        INTEGER NOT NULL,
    WeekNumberOfYear       INTEGER NOT NULL,
    MonthName              TEXT NOT NULL,
    MonthNumberOfYear      INTEGER NOT NULL,
    CalendarQuarter        INTEGER NOT NULL,
    CalendarYear           INTEGER NOT NULL,
    FiscalQuarter          INTEGER NOT NULL,
    FiscalYear             INTEGER NOT NULL 
);
'''

create table in dimdate in schoool sqlite database

In [63]:
cur.executescript(dimdate)

pndas load the csv file in slite database

In [78]:
data.to_sql('dimate', conn, if_exists='replace', index=False)

3652

fetch the all row in dimate table

In [145]:
cur.execute('select  count(DateKey)  from dimate').fetchall()

[(3652,)]

display the dimate table in sqlite database

In [128]:
# for row in cur.execute('select * from dimate'):
#     print(row)

In [126]:
factinternetsales = '''

DROP TABLE IF EXISTS factinternetsales;

CREATE TABLE [factinternetsales](
    [ProductKey]             [int]      NOT NULL ,
    [OrderDateKey]           [int]      NOT NULL,
    [DueDateKey]             [int]      NOT NULL,
    [ShipDateKey]            [int]      NOT NULL,
    [CustomerKey]            [int]      NOT NULL,
    [PromotionKey]           [int]      NOT NULL,
    [CurrencyKey]            [int]      NOT NULL,
    [SalesTerritoryKey]      [int]      NOT NULL,
    [OrderQuantity]          [smallint] NOT NULL,
    [UnitPrice]              [money]    NOT NULL,
    [UnitPriceDiscountPct]   [float]    NOT NULL,
    [DiscountAmount]         [float]    NOT NULL,
    [ProductStandardCost]    [money]    NOT NULL,
    [TotalProductCost]       [money]    NOT NULL,
    [SalesAmount]            [money]    NOT NULL  CHECK (SalesAmount >= 0 ),
    [TaxAmt]                 [money]    NOT NULL,
    [Freight]                [money]    NOT NULL,
    [OrderDate]              [datetime] NULL,
    [DueDate]                [datetime] NULL,
    [ShipDate]               [datetime] NULL,
    [TaxRate]                [real]     NULL  DEFAULT 0, 
    [ProfitMargin]           [real]     NULL,
    [InsertDate]             TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP,
    FOREIGN KEY(ProductKey)        REFERENCES dimproduct(ProductKey),
    FOREIGN KEY(SalesTerritoryKey) REFERENCES dimsalesterritory(SalesTerritoryKey)
);
'''

In [127]:
cur.executescript(factinternetsales)

In [123]:
sales = pd.read_csv('data/FactInternetSales2014.csv')
sales.dtypes

ProductKey                 int64
OrderDateKey               int64
DueDateKey                 int64
ShipDateKey                int64
CustomerKey                int64
PromotionKey               int64
CurrencyKey                int64
SalesTerritoryKey          int64
SalesOrderNumber          object
SalesOrderLineNumber       int64
RevisionNumber             int64
OrderQuantity              int64
UnitPrice                float64
ExtendedAmount           float64
UnitPriceDiscountPct       int64
DiscountAmount             int64
ProductStandardCost      float64
TotalProductCost         float64
SalesAmount              float64
TaxAmt                   float64
Freight                  float64
CarrierTrackingNumber    float64
CustomerPONumber         float64
OrderDate                 object
DueDate                   object
ShipDate                  object
dtype: object

In [73]:
facsales = '''
SELECT 
       ProductKey,
       OrderDateKey,
       DueDateKey,
       ShipDateKey,
       CustomerKey,
       PromotionKey,
       CurrencyKey,
       SalesTerritoryKey,
       OrderQuantity,
       UnitPrice,
       UnitPriceDiscountPct,
       DiscountAmount,
       ProductStandardCost,
       TotalProductCost,
       SalesAmount,
       TaxAmt,
       Freight,
       OrderDate,
       DueDate,
       ShipDate,
       round((TaxAmt/SalesAmount),2) as TaxRate,
       round(((SalesAmount - TotalProductCost ) / SalesAmount), 2) as ProfitMargin
  FROM dffactinternetsales  
'''

In [131]:
# pysqldf(facsales)